             PGM

             DCL        VAR(&MSG) TYPE(*CHAR) LEN(256)

             MONMSG     MSGID(CPF0000) EXEC(DO)
             RCVMSG     MSGTYPE(*EXCP) MSG(&MSG)
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA(&MSG) +
                          MSGTYPE(*ESCAPE)
             ENDDO

             CRTRPGMOD  MODULE(*CURLIB/TSTRULES) +
                          SRCFILE(*CURLIB/QRPGLESRC) SRCMBR(TSTRULES) +
                          DBGVIEW(*SOURCE)
             CRTSRVPGM  SRVPGM(*CURLIB/TSTRULES) +
                          MODULE(*CURLIB/TSTRULES) +
                          SRCFILE(*CURLIB/QSRVSRC) SRCMBR(TSTRULES) +
                          BNDSRVPGM(*LIBL/GLBRULES)

             CRTSQLRPGI OBJ(*CURLIB/TSTDATA) +
                          SRCFILE(*CURLIB/QRPGLESRC) SRCMBR(TSTDATA) +
                          OBJTYPE(*MODULE) DBGVIEW(*SOURCE)
             CRTSRVPGM  SRVPGM(*CURLIB/TSTDATA) +
                          MODULE(*CURLIB/TSTDATA) +
                          SRCFILE(*CURLIB/QSRVSRC) SRCMBR(TSTDATA) +
                          BNDSRVPGM(*LIBL/GLBDATA)

             CRTSQLRPGI OBJ(*CURLIB/TSTJSON) +
                          SRCFILE(*CURLIB/QRPGLESRC) SRCMBR(TSTJSON) +
                          OBJTYPE(*MODULE) DBGVIEW(*SOURCE)
             CRTSRVPGM  SRVPGM(*CURLIB/TSTJSON) +
                          MODULE(*CURLIB/TSTJSON) +
                          SRCFILE(*CURLIB/QSRVSRC) SRCMBR(TSTJSON) +
                          BNDSRVPGM(*LIBL/GLBJSON)

             CRTSQLRPGI OBJ(*CURLIB/TSTIFS) +
                          SRCFILE(*CURLIB/QRPGLESRC) SRCMBR(TSTIFS) +
                          OBJTYPE(*MODULE) DBGVIEW(*SOURCE)
             CRTSRVPGM  SRVPGM(*CURLIB/TSTIFS) +
                          MODULE(*CURLIB/TSTIFS) +
                          SRCFILE(*CURLIB/QSRVSRC) SRCMBR(TSTIFS) +
                          BNDSRVPGM(*LIBL/GLBIFS) BNDDIR(QC2LE)

             CRTSQLRPGI OBJ(*CURLIB/TSTLOG) +
                          SRCFILE(*CURLIB/QRPGLESRC) SRCMBR(TSTLOG) +
                          OBJTYPE(*MODULE) DBGVIEW(*SOURCE)
             CRTSRVPGM  SRVPGM(*CURLIB/TSTLOG) +
                          MODULE(*CURLIB/TSTLOG) +
                          SRCFILE(*CURLIB/QSRVSRC) SRCMBR(TSTLOG) +
                          BNDSRVPGM(*LIBL/GLBLOG)

             CRTRPGMOD  MODULE(*CURLIB/TSTBATCH) +
                          SRCFILE(*CURLIB/QRPGLESRC) SRCMBR(TSTBATCH) +
                          DBGVIEW(*SOURCE)
             CRTSRVPGM  SRVPGM(*CURLIB/TSTBATCH) +
                          MODULE(*CURLIB/TSTBATCH) +
                          SRCFILE(*CURLIB/QSRVSRC) SRCMBR(TSTBATCH)

             CRTBNDRPG  PGM(*CURLIB/RUNTST) +
                          SRCFILE(*CURLIB/QRPGLESRC) SRCMBR(RUNTST) +
                          DBGVIEW(*SOURCE) +
                          BNDSRVPGM(*CURLIB/TSTRULES +
                                    *CURLIB/TSTDATA +
                                    *CURLIB/TSTJSON +
                                    *CURLIB/TSTIFS +
                                    *CURLIB/TSTLOG +
                                    *CURLIB/TSTBATCH)

             CRTCLPGM   PGM(*CURLIB/TSTSUITE) +
                          SRCFILE(*CURLIB/QCLLESRC) SRCMBR(TSTSUITE)

             ENDPGM
